### Introduction to SQL

SQL (Structured Query Language) is a standard language for managing and manipulating relational databases. It allows you to create, retrieve, update, and delete data in a database. It's the primary language used by database administrators, developers, and data analysts to interact with database systems.

### Types of SQL Commands

SQL commands are broadly categorized into several types based on their functionality:

1.  **Data Definition Language (DDL)**: Used to define and modify the database schema. These commands deal with the structure of the database.
    *   `CREATE`: To create databases, tables, views, etc.
    *   `ALTER`: To modify the structure of existing database objects.
    *   `DROP`: To delete database objects.
    *   `TRUNCATE`: To remove all records from a table, including space allocated for the records.
    *   `RENAME`: To rename a database object.

2.  **Data Manipulation Language (DML)**: Used to manage data within schema objects. These commands affect the data itself.
    *   `INSERT`: To add new rows of data into a table.
    *   `UPDATE`: To modify existing data in a table.
    *   `DELETE`: To remove rows from a table.

3.  **Data Control Language (DCL)**: Used to control access permissions and rights to the database. These commands deal with security.
    *   `GRANT`: To give user access privileges to a database.
    *   `REVOKE`: To remove user access privileges.

4.  **Transaction Control Language (TCL)**: Used to manage transactions within the database. Transactions are a sequence of operations performed as a single logical unit of work.
    *   `COMMIT`: To save the work done in a transaction.
    *   `ROLLBACK`: To undo a transaction that has not been saved.
    *   `SAVEPOINT`: To set a point within a transaction to which you can later roll back.

### Restaurant Table

This table will store information about different restaurants. Below is the SQL code to create the table and insert some sample data.

**Columns created:**
*   `restaurant_id`: An integer that uniquely identifies each restaurant. It's the primary key.
*   `name`: A string (varchar) for the name of the restaurant.
*   `cuisine`: A string (varchar) indicating the type of cuisine the restaurant serves (e.g., 'Italian', 'Mexican').
*   `address`: A string (varchar) for the physical address of the restaurant.
*   `rating`: A decimal number representing the restaurant's rating.

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database for demonstration
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create the restaurant table
cursor.execute('''
CREATE TABLE restaurant (
    restaurant_id INTEGER PRIMARY KEY,
    name VARCHAR(255) NOT NULL,
    cuisine VARCHAR(100),
    address VARCHAR(255),
    rating DECIMAL(2, 1)
);
''')

# Insert values into the restaurant table in one go
cursor.execute("""
INSERT INTO restaurant (restaurant_id, name, cuisine, address, rating) VALUES
(1, 'Pizza Palace', 'Italian', '123 Main St', 4.5),
(2, 'Taco Time', 'Mexican', '456 Oak Ave', 4.2),
(3, 'Sushi Spot', 'Japanese', '789 Pine Ln', 4.8),
(4, 'Burger Barn', 'American', '101 Elm St', 3.9),
(5, 'Curry House', 'Indian', '202 Maple Ave', 4.7),
(6, 'Pasta Place', 'Italian', '303 Birch Rd', 4.1),
(7, 'Mexicano Grill', 'Mexican', '404 Pine St', 4.3),
(8, 'Noodle Nirvana', 'Thai', '505 Cedar Ln', 4.6),
(9, 'Steakhouse Supreme', 'Steakhouse', '606 Oak Dr', 4.9),
(10, 'Vegan Delights', 'Vegan', '707 Walnut Blvd', 4.0);
""")

conn.commit()

print("Restaurant table created and data inserted.")

# Verify data
cursor.execute("SELECT * FROM restaurant;")
print("\nRestaurant data:")
for row in cursor.fetchall():
    print(row)

Restaurant table created and data inserted.

Restaurant data:
(1, 'Pizza Palace', 'Italian', '123 Main St', 4.5)
(2, 'Taco Time', 'Mexican', '456 Oak Ave', 4.2)
(3, 'Sushi Spot', 'Japanese', '789 Pine Ln', 4.8)
(4, 'Burger Barn', 'American', '101 Elm St', 3.9)
(5, 'Curry House', 'Indian', '202 Maple Ave', 4.7)
(6, 'Pasta Place', 'Italian', '303 Birch Rd', 4.1)
(7, 'Mexicano Grill', 'Mexican', '404 Pine St', 4.3)
(8, 'Noodle Nirvana', 'Thai', '505 Cedar Ln', 4.6)
(9, 'Steakhouse Supreme', 'Steakhouse', '606 Oak Dr', 4.9)
(10, 'Vegan Delights', 'Vegan', '707 Walnut Blvd', 4)

### Orders Table

This table will store information about customer orders made at the restaurants. Below is the SQL code to create the table and insert some sample data.

**Columns created:**
*   `order_id`: An integer that uniquely identifies each order. It's the primary key.
*   `restaurant_id`: An integer that links to the `restaurant_id` in the `restaurant` table, indicating which restaurant the order belongs to. It's a foreign key.
*   `customer_name`: A string (varchar) for the name of the customer who placed the order.
*   `order_date`: A date indicating when the order was placed.
*   `total_amount`: A decimal number representing the total cost of the order.
*   `status`: A string (varchar) indicating the current status of the order (e.g., 'Pending', 'Completed', 'Cancelled').

In [ ]:
# Create the orders table
cursor.execute('''
CREATE TABLE orders (
    order_id INTEGER PRIMARY KEY,
    restaurant_id INTEGER NOT NULL,
    customer_name VARCHAR(255),
    order_date DATE,
    total_amount DECIMAL(10, 2),
    status VARCHAR(50),
    FOREIGN KEY (restaurant_id) REFERENCES restaurant(restaurant_id)
);
''')

# Insert values into the orders table in one go
cursor.execute("""
INSERT INTO orders (order_id, restaurant_id, customer_name, order_date, total_amount, status) VALUES
(101, 1, 'Alice Smith', '2023-10-26', 25.50, 'Completed'),
(102, 1, 'Bob Johnson', '2023-10-26', 30.00, 'Pending'),
(103, 2, 'Charlie Brown', '2023-10-25', 15.75, 'Completed'),
(104, 3, 'Diana Prince', '2023-10-26', 50.20, 'Pending'),
(105, 4, 'Eve Adams', '2023-10-27', 18.00, 'Completed'),
(106, 5, 'Frank White', '2023-10-27', 45.30, 'Pending'),
(107, 6, 'Grace Green', '2023-10-28', 22.50, 'Completed'),
(108, 7, 'Harry Black', '2023-10-28', 35.00, 'Pending'),
(109, 8, 'Ivy Lee', '2023-10-29', 60.00, 'Completed'),
(110, 9, 'Jack King', '2023-10-29', 28.75, 'Pending');
""")

conn.commit()

print("\nOrders table created and data inserted.")

# Verify data
cursor.execute("SELECT * FROM orders;")
print("\nOrders data:")
for row in cursor.fetchall():
    print(row)

# Close the connection
conn.close()

Orders table created and data inserted.

Orders data:
(101, 1, 'Alice Smith', '2023-10-26', 25.5, 'Completed')
(102, 1, 'Bob Johnson', '2023-10-26', 30, 'Pending')
(103, 2, 'Charlie Brown', '2023-10-25', 15.75, 'Completed')
(104, 3, 'Diana Prince', '2023-10-26', 50.2, 'Pending')
(105, 4, 'Eve Adams', '2023-10-27', 18, 'Completed')
(106, 5, 'Frank White', '2023-10-27', 45.3, 'Pending')
(107, 6, 'Grace Green', '2023-10-28', 22.5, 'Completed')
(108, 7, 'Harry Black', '2023-10-28', 35, 'Pending')
(109, 8, 'Ivy Lee', '2023-10-29', 60, 'Completed')
(110, 9, 'Jack King', '2023-10-29', 28.75, 'Pending')

### Basic SQL Commands Demonstration

Let's explore some fundamental SQL commands using the `restaurant` and `orders` tables. Since we are using an in-memory SQLite database, we need to re-establish the connection and re-populate the tables for each demonstration of commands that modify the database or when starting a new session.

In [ ]:
import sqlite3

# Reconnect to the in-memory database to continue working with the tables
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Re-create the restaurant table and insert data (as it's an in-memory database, it resets)
cursor.execute('''
CREATE TABLE restaurant (
    restaurant_id INTEGER PRIMARY KEY,
    name VARCHAR(255) NOT NULL,
    cuisine VARCHAR(100),
    address VARCHAR(255),
    rating DECIMAL(2, 1)
);
''')
cursor.execute("""
INSERT INTO restaurant (restaurant_id, name, cuisine, address, rating) VALUES
(1, 'Pizza Palace', 'Italian', '123 Main St', 4.5),
(2, 'Taco Time', 'Mexican', '456 Oak Ave', 4.2),
(3, 'Sushi Spot', 'Japanese', '789 Pine Ln', 4.8),
(4, 'Burger Barn', 'American', '101 Elm St', 3.9),
(5, 'Curry House', 'Indian', '202 Maple Ave', 4.7),
(6, 'Pasta Place', 'Italian', '303 Birch Rd', 4.1),
(7, 'Mexicano Grill', 'Mexican', '404 Pine St', 4.3),
(8, 'Noodle Nirvana', 'Thai', '505 Cedar Ln', 4.6),
(9, 'Steakhouse Supreme', 'Steakhouse', '606 Oak Dr', 4.9),
(10, 'Vegan Delights', 'Vegan', '707 Walnut Blvd', 4.0);
""")

# Re-create the orders table and insert data
cursor.execute('''
CREATE TABLE orders (
    order_id INTEGER PRIMARY KEY,
    restaurant_id INTEGER NOT NULL,
    customer_name VARCHAR(255),
    order_date DATE,
    total_amount DECIMAL(10, 2),
    status VARCHAR(50),
    FOREIGN KEY (restaurant_id) REFERENCES restaurant(restaurant_id)
);
''')
cursor.execute("""
INSERT INTO orders (order_id, restaurant_id, customer_name, order_date, total_amount, status) VALUES
(101, 1, 'Alice Smith', '2023-10-26', 25.50, 'Completed'),
(102, 1, 'Bob Johnson', '2023-10-26', 30.00, 'Pending'),
(103, 2, 'Charlie Brown', '2023-10-25', 15.75, 'Completed'),
(104, 3, 'Diana Prince', '2023-10-26', 50.20, 'Pending'),
(105, 4, 'Eve Adams', '2023-10-27', 18.00, 'Completed'),
(106, 5, 'Frank White', '2023-10-27', 45.30, 'Pending'),
(107, 6, 'Grace Green', '2023-10-28', 22.50, 'Completed'),
(108, 7, 'Harry Black', '2023-10-28', 35.00, 'Pending'),
(109, 8, 'Ivy Lee', '2023-10-29', 60.00, 'Completed'),
(110, 9, 'Jack King', '2023-10-29', 28.75, 'Pending');
""")
conn.commit()

print("Database reset and tables re-populated for demonstration.")

Database reset and tables re-populated for demonstration.

### 1. SELECT Command

**Purpose**: The `SELECT` statement is fundamental for retrieving data from a database. You can select all columns using `*` or specify individual columns. It's often combined with `WHERE` to filter results.

In [ ]:
# Select all columns and all rows from the restaurant table
print("\nAll restaurants:")
cursor.execute("SELECT * FROM restaurant;")
for row in cursor.fetchall():
    print(row)

All restaurants:
(1, 'Pizza Palace', 'Italian', '123 Main St', 4.5)
(2, 'Taco Time', 'Mexican', '456 Oak Ave', 4.2)
(3, 'Sushi Spot', 'Japanese', '789 Pine Ln', 4.8)
(4, 'Burger Barn', 'American', '101 Elm St', 3.9)
(5, 'Curry House', 'Indian', '202 Maple Ave', 4.7)
(6, 'Pasta Place', 'Italian', '303 Birch Rd', 4.1)
(7, 'Mexicano Grill', 'Mexican', '404 Pine St', 4.3)
(8, 'Noodle Nirvana', 'Thai', '505 Cedar Ln', 4.6)
(9, 'Steakhouse Supreme', 'Steakhouse', '606 Oak Dr', 4.9)
(10, 'Vegan Delights', 'Vegan', '707 Walnut Blvd', 4)

In [ ]:
# Select specific columns (name, cuisine) from the restaurant table
print("\nRestaurant names and cuisines:")
cursor.execute("SELECT name, cuisine FROM restaurant;")
for row in cursor.fetchall():
    print(row)

Restaurant names and cuisines:
('Pizza Palace', 'Italian')
('Taco Time', 'Mexican')
('Sushi Spot', 'Japanese')
('Burger Barn', 'American')
('Curry House', 'Indian')
('Pasta Place', 'Italian')
('Mexicano Grill', 'Mexican')
('Noodle Nirvana', 'Thai')
('Steakhouse Supreme', 'Steakhouse')
('Vegan Delights', 'Vegan')

### 2. WHERE Clause

**Purpose**: The `WHERE` clause is used to filter records based on a specified condition. It's crucial for querying specific data and is used with `SELECT`, `UPDATE`, and `DELETE` statements.

In [ ]:
# Select restaurants with a rating greater than 4.5
print("\nRestaurants with rating > 4.5:")
cursor.execute("SELECT name, rating FROM restaurant WHERE rating > 4.5;")
for row in cursor.fetchall():
    print(row)

Restaurants with rating > 4.5:
('Sushi Spot', 4.8)
('Curry House', 4.7)
('Noodle Nirvana', 4.6)
('Steakhouse Supreme', 4.9)

In [ ]:
# Select orders with 'Pending' status
print("\nPending orders:")
cursor.execute("SELECT order_id, customer_name, status FROM orders WHERE status = 'Pending';")
for row in cursor.fetchall():
    print(row)

Pending orders:
(102, 'Bob Johnson', 'Pending')
(104, 'Diana Prince', 'Pending')
(106, 'Frank White', 'Pending')
(108, 'Harry Black', 'Pending')
(110, 'Jack King', 'Pending')

### 3. INSERT INTO Command

**Purpose**: The `INSERT INTO` statement adds new rows of data into a table. You can specify values for all columns or a subset of columns, ensuring data integrity.

In [ ]:
# Insert a new restaurant
cursor.execute("INSERT INTO restaurant (restaurant_id, name, cuisine, address, rating) VALUES (11, 'Grill House', 'BBQ', '808 River Rd', 4.3);")
conn.commit()
print("\nNew restaurant inserted.")

New restaurant inserted.

In [ ]:
# Verify insertion
print("Updated restaurant list:")
cursor.execute("SELECT * FROM restaurant WHERE restaurant_id = 11;")
for row in cursor.fetchall():
    print(row)

Updated restaurant list:
(11, 'Grill House', 'BBQ', '808 River Rd', 4.3)

### 4. UPDATE Command

**Purpose**: The `UPDATE` statement modifies existing records in a table. Using a `WHERE` clause is essential to target specific rows; otherwise, all rows will be updated.

In [ ]:
# Update the rating of 'Pizza Palace'
cursor.execute("UPDATE restaurant SET rating = 4.8 WHERE name = 'Pizza Palace';")
conn.commit()
print("\nRating for Pizza Palace updated.")

Rating for Pizza Palace updated.

In [ ]:
# Verify update
print("Pizza Palace after update:")
cursor.execute("SELECT name, rating FROM restaurant WHERE name = 'Pizza Palace';")
for row in cursor.fetchall():
    print(row)

Pizza Palace after update:
('Pizza Palace', 4.8)

### 5. DELETE FROM Command

**Purpose**: The `DELETE FROM` statement removes existing records from a table. Always use a `WHERE` clause to prevent deleting all records unintentionally.

In [ ]:
# Delete the newly added restaurant 'Grill House'
cursor.execute("DELETE FROM restaurant WHERE name = 'Grill House';")
conn.commit()
print("\n'Grill House' deleted.")

# Verify deletion (should return no rows)
print("Checking for 'Grill House' after deletion:")
cursor.execute("SELECT * FROM restaurant WHERE name = 'Grill House';")
if not cursor.fetchall():
    print("Grill House not found.")
else:
    print("Grill House still exists (error).")

'Grill House' deleted.
Checking for 'Grill House' after deletion:
Grill House not found.

### 6. ALTER TABLE Command

**Purpose**: The `ALTER TABLE` statement (a DDL command) modifies the structure of an existing table, allowing you to add, delete, or modify columns, or add/drop constraints.

In [ ]:
# Add a new column 'phone_number' to the restaurant table
cursor.execute("ALTER TABLE restaurant ADD COLUMN phone_number VARCHAR(20);")
conn.commit()
print("\n'phone_number' column added to restaurant table.")

# Verify the new column by checking schema (SQLite's PRAGMA table_info)
print("Restaurant table schema after adding column:")
cursor.execute("PRAGMA table_info(restaurant);")
for row in cursor.fetchall():
    print(row)

'phone_number' column added to restaurant table.
Restaurant table schema after adding column:
(0, 'restaurant_id', 'INTEGER', 0, None, 1)
(1, 'name', 'VARCHAR(255)', 1, None, 0)
(2, 'cuisine', 'VARCHAR(100)', 0, None, 0)
(3, 'address', 'VARCHAR(255)', 0, None, 0)
(4, 'rating', 'DECIMAL(2, 1)', 0, None, 0)
(5, 'phone_number', 'VARCHAR(20)', 0, None, 0)

### Exploring Advanced SQL Concepts

Now that we've covered the basics of defining and manipulating data, let's dive into some more powerful SQL commands and clauses. These will help us organize, summarize, and combine data in more complex and useful ways.

### 1. ORDER BY Clause

**What it is**: The `ORDER BY` clause is used to sort the results of your query. Think of it like sorting a list alphabetically or by size. You can sort by one or more columns, either in ascending order (`ASC`, which is the default) or descending order (`DESC`).

**Why we use it**: It helps organize your data in a meaningful sequence, making it easier to read and analyze. For example, you might want to see the highest-rated restaurants first, or the oldest orders last.

**Real-world Use Cases**:
*   **Ranking**: Finding the top 5 students by score or the 10 most popular products by sales volume.
*   **Time-Series Analysis**: Displaying recent activities first, like the latest customer transactions or newest blog posts.
*   **Reporting**: Arranging data for reports in a logical sequence, such as customers listed alphabetically by last name or products by price.

In [ ]:
# Select all restaurants and order them by rating in descending order (highest rating first)
print("\nRestaurants ordered by rating (descending):")
cursor.execute("SELECT name, rating FROM restaurant ORDER BY rating DESC;")
for row in cursor.fetchall():
    print(row)

Restaurants ordered by rating (descending):
('Steakhouse Supreme', 4.9)
('Pizza Palace', 4.8)
('Sushi Spot', 4.8)
('Curry House', 4.7)
('Noodle Nirvana', 4.6)
('Mexicano Grill', 4.3)
('Taco Time', 4.2)
('Pasta Place', 4.1)
('Vegan Delights', 4)
('Burger Barn', 3.9)

In [ ]:
# Select orders and order them by total amount in ascending order (lowest amount first)
print("\nOrders ordered by total amount (ascending):")
cursor.execute("SELECT order_id, customer_name, total_amount FROM orders ORDER BY total_amount ASC;")
for row in cursor.fetchall():
    print(row)

Orders ordered by total amount (ascending):
(103, 'Charlie Brown', 15.75)
(105, 'Eve Adams', 18)
(107, 'Grace Green', 22.5)
(101, 'Alice Smith', 25.5)
(110, 'Jack King', 28.75)
(102, 'Bob Johnson', 30)
(108, 'Harry Black', 35)
(106, 'Frank White', 45.3)
(104, 'Diana Prince', 50.2)
(109, 'Ivy Lee', 60)

### 2. LIMIT Clause

**What it is**: The `LIMIT` clause restricts the number of rows that your query returns. It's like asking for only the first few items from a sorted list.

**Why we use it**: It's incredibly useful for managing the size of your results, especially when dealing with large datasets, and is often combined with `ORDER BY`.

**Real-world Use Cases**:
*   **Pagination**: Showing a fixed number of items per page in an online store or search results.
*   **Sampling**: Quickly inspecting a small subset of data to understand its structure or identify issues, without loading everything.
*   **Top/Bottom N Analysis**: When paired with `ORDER BY`, it helps identify the best or worst performers, like the top 3 selling items or the 2 cheapest services.

In [ ]:
# Get the top 3 highest-rated restaurants
print("\nTop 3 highest-rated restaurants:")
cursor.execute("SELECT name, rating FROM restaurant ORDER BY rating DESC LIMIT 3;")
for row in cursor.fetchall():
    print(row)

Top 3 highest-rated restaurants:
('Steakhouse Supreme', 4.9)
('Pizza Palace', 4.8)
('Sushi Spot', 4.8)

In [ ]:
# Get the 2 cheapest orders
print("\nTwo cheapest orders:")
cursor.execute("SELECT order_id, total_amount FROM orders ORDER BY total_amount ASC LIMIT 2;")
for row in cursor.fetchall():
    print(row)

Two cheapest orders:
(103, 15.75)
(105, 18)

### 3. Aggregate Functions (COUNT, SUM, AVG, MIN, MAX)

**What they are**: Aggregate functions perform calculations on a set of rows and return a single summary value. Instead of giving you individual data points, they provide a statistical overview.

*   `COUNT()`: Counts the number of rows or non-NULL values.
*   `SUM()`: Adds up all the values in a numeric column.
*   `AVG()`: Calculates the average value of a numeric column.
*   `MIN()`: Finds the smallest value in a column.
*   `MAX()`: Finds the largest value in a column.

**Why we use them**: These functions are essential for summarizing data, generating reports, and gaining insights into trends or overall performance.

**Real-world Use Cases**:
*   **Performance Metrics**: Calculating the average rating for a product, the total revenue for a month, or the number of active users.
*   **Resource Management**: Finding the minimum and maximum inventory levels or the total budget spent.
*   **Reporting**: Generating summaries like 'total number of customers', 'average order value', or 'highest recorded temperature'.

In [ ]:
# Count the total number of restaurants
print("\nTotal number of restaurants:")
cursor.execute("SELECT COUNT(*) FROM restaurant;")
print(cursor.fetchone()[0])

# Calculate the average rating of restaurants
print("\nAverage restaurant rating:")
cursor.execute("SELECT AVG(rating) FROM restaurant;")
print(cursor.fetchone()[0])

# Find the total sum of all order amounts
print("\nTotal sum of all order amounts:")
cursor.execute("SELECT SUM(total_amount) FROM orders;")
print(cursor.fetchone()[0])

# Find the maximum order amount
print("\nMaximum order amount:")
cursor.execute("SELECT MAX(total_amount) FROM orders;")
print(cursor.fetchone()[0])

Total number of restaurants:
10

Average restaurant rating:
4.43

Total sum of all order amounts:
331.0

Maximum order amount:
60

### 4. GROUP BY Clause

**What it is**: The `GROUP BY` clause groups rows that have the same values in one or more columns into a set of summary rows. It's often used with aggregate functions.

**Why we use it**: It allows you to perform calculations (like `SUM`, `COUNT`, `AVG`) on each group rather than on the entire dataset. For example, instead of getting the total sales for *all* orders, you can get the total sales for *each* customer or *each* restaurant.

**Real-world Use Cases**:
*   **Sales Analysis**: Calculating total sales per product category, per region, or per salesperson.
*   **Demographic Insights**: Counting customers by city, age group, or loyalty program tier.
*   **Website Analytics**: Determining the number of visits from each operating system or browser type.

In [ ]:
# Count the number of restaurants for each cuisine type
print("\nNumber of restaurants per cuisine:")
cursor.execute("SELECT cuisine, COUNT(*) FROM restaurant GROUP BY cuisine;")
for row in cursor.fetchall():
    print(row)

Number of restaurants per cuisine:
('American', 1)
('Indian', 1)
('Italian', 2)
('Japanese', 1)
('Mexican', 2)
('Steakhouse', 1)
('Thai', 1)
('Vegan', 1)

In [ ]:
# Calculate the total amount for orders made at each restaurant
print("\nTotal order amount per restaurant (using JOIN for restaurant name):")
cursor.execute("SELECT R.name, SUM(O.total_amount) FROM restaurant R JOIN orders O ON R.restaurant_id = O.restaurant_id GROUP BY R.name;")
for row in cursor.fetchall():
    print(row)

Total order amount per restaurant (using JOIN for restaurant name):
('Burger Barn', 18)
('Curry House', 45.3)
('Mexicano Grill', 35)
('Noodle Nirvana', 60)
('Pasta Place', 22.5)
('Pizza Palace', 55.5)
('Steakhouse Supreme', 28.75)
('Sushi Spot', 50.2)
('Taco Time', 15.75)

### 5. HAVING Clause

**What it is**: The `HAVING` clause is used to filter groups that are created by the `GROUP BY` clause. It's like a `WHERE` clause, but it operates on *groups* of rows after they've been aggregated, rather than on individual rows.

**Why we use it**: You cannot use aggregate functions directly in a `WHERE` clause. `HAVING` solves this by allowing you to filter based on the results of aggregate calculations. For example, if you want to find only those cuisine types that have *more than one* restaurant, you'd use `HAVING`.

**Real-world Use Cases**:
*   **Identifying High-Performers**: Finding product categories with average sales above a certain threshold.
*   **Anomaly Detection**: Spotting customer segments with an unusually high number of returns or low average order value.
*   **Resource Allocation**: Locating regions where the total project budget has exceeded a specific limit.

In [ ]:
# Find cuisines that have more than 1 restaurant
print("\nCuisines with more than one restaurant:")
cursor.execute("SELECT cuisine, COUNT(*) FROM restaurant GROUP BY cuisine HAVING COUNT(*) > 1;")
for row in cursor.fetchall():
    print(row)

Cuisines with more than one restaurant:
('Italian', 2)
('Mexican', 2)

### 6. DISTINCT Keyword

**What it is**: The `DISTINCT` keyword is used in a `SELECT` statement to return only unique values. It removes duplicate rows from the result set.

**Why we use it**: When you query a column, you might get many repeated values. `DISTINCT` helps you see all the different possible values, which is useful for understanding categories or types of data present without repetitions.

**Real-world Use Cases**:
*   **Categorization**: Listing all unique product categories available in a store.
*   **User Management**: Getting a list of all distinct cities where your users reside.
*   **Data Validation**: Checking for the different types of statuses an order can have.

In [ ]:
# Get all unique cuisine types from the restaurant table
print("\nUnique cuisine types:")
cursor.execute("SELECT DISTINCT cuisine FROM restaurant;")
for row in cursor.fetchall():
    print(row[0])

Unique cuisine types:
Italian
Mexican
Japanese
American
Indian
Thai
Steakhouse
Vegan

### 7. SQL JOINs

**What they are**: SQL `JOIN` clauses are fundamental for combining data from two or more tables. Databases often store related information in separate tables to maintain organization and efficiency. A `JOIN` links these tables together based on a common column (like `restaurant_id` between `restaurant` and `orders`).

**Why we use them**: They allow you to pull all related information together into a single result set. For example, to find out which restaurant an order came from, you need to `JOIN` the `orders` table with the `restaurant` table.

**Types of JOINs**:

*   **INNER JOIN**: This is the most common type of join. It returns only the rows where there is a match in *both* tables based on the join condition. If a record in one table doesn't have a matching record in the other, it's excluded.
    *   **Real-world Use Case**: Getting a list of all orders *that actually have a corresponding restaurant*. If a restaurant has no orders, or an order has no matching restaurant, they won't appear.

*   **LEFT (OUTER) JOIN**: This join returns all rows from the 'left' table (the first table mentioned in the `FROM` or `JOIN` clause), and the matching rows from the 'right' table. If there's no match in the right table, it will still show the left table's data, with `NULL` values for the right table's columns.
    *   **Real-world Use Case**: Listing *all* restaurants and, if they have any, their orders. Restaurants with no orders will still show up, but their order details will be `NULL`.

*   **RIGHT (OUTER) JOIN**: This is the opposite of a `LEFT JOIN`. It returns all rows from the 'right' table, and the matching rows from the 'left' table. If there's no match in the left table, it shows `NULL` for its columns. *(Note: SQLite, the database we're using, does not directly support `RIGHT JOIN`.)*
    *   **Real-world Use Case**: Listing *all* orders and, if they have any, their corresponding restaurants. Orders without a matching restaurant would still show up.

*   **FULL (OUTER) JOIN**: This join returns all rows when there is a match in either the left or the right table. It combines the results of both `LEFT JOIN` and `RIGHT JOIN`. It includes all records from both tables, and fills in `NULL`s where there is no match.
    *   **Real-world Use Case**: Seeing all restaurants *and* all orders, regardless of whether they have a match in the other table. This is useful for comprehensive reporting or finding discrepancies. *(Note: SQLite does not directly support `FULL OUTER JOIN`.)*

In [ ]:
# Demonstrate INNER JOIN: Get all orders along with the name of the restaurant they came from.
print("\nOrders with associated restaurant names (INNER JOIN):")
cursor.execute("""
SELECT O.order_id, O.customer_name, R.name AS restaurant_name, O.total_amount
FROM orders O
INNER JOIN restaurant R ON O.restaurant_id = R.restaurant_id;
""")
for row in cursor.fetchall():
    print(row)

Orders with associated restaurant names (INNER JOIN):
(101, 'Alice Smith', 'Pizza Palace', 25.5)
(102, 'Bob Johnson', 'Pizza Palace', 30)
(103, 'Charlie Brown', 'Taco Time', 15.75)
(104, 'Diana Prince', 'Sushi Spot', 50.2)
(105, 'Eve Adams', 'Burger Barn', 18)
(106, 'Frank White', 'Curry House', 45.3)
(107, 'Grace Green', 'Pasta Place', 22.5)
(108, 'Harry Black', 'Mexicano Grill', 35)
(109, 'Ivy Lee', 'Noodle Nirvana', 60)
(110, 'Jack King', 'Steakhouse Supreme', 28.75)

In [ ]:
# Demonstrate LEFT JOIN: Get all restaurants and any orders associated with them.
# Restaurants without orders will still appear, with NULLs for order details.
print("\nAll restaurants and their orders (LEFT JOIN):")
cursor.execute("""
SELECT R.name AS restaurant_name, O.order_id, O.customer_name, O.total_amount, O.status
FROM restaurant R
LEFT JOIN orders O ON R.restaurant_id = O.restaurant_id;
""")
for row in cursor.fetchall():
    print(row)

# Let's add a restaurant that has no orders, and then run the LEFT JOIN again to see the NULLs clearly.
cursor.execute("INSERT INTO restaurant (restaurant_id, name, cuisine, address, rating) VALUES (12, 'Empty Table Bistro', 'French', '555 Side Street', 4.1);")
conn.commit()

print("\nAll restaurants including one with no orders (LEFT JOIN, after adding 'Empty Table Bistro'):")
cursor.execute("""
SELECT R.name AS restaurant_name, O.order_id, O.customer_name, O.total_amount, O.status
FROM restaurant R
LEFT JOIN orders O ON R.restaurant_id = O.restaurant_id;
""")
for row in cursor.fetchall():
    print(row)

# Close the database connection once all demonstrations are complete
conn.close()

All restaurants and their orders (LEFT JOIN):
('Pizza Palace', 101, 'Alice Smith', 25.5, 'Completed')
('Pizza Palace', 102, 'Bob Johnson', 30, 'Pending')
('Taco Time', 103, 'Charlie Brown', 15.75, 'Completed')
('Sushi Spot', 104, 'Diana Prince', 50.2, 'Pending')
('Burger Barn', 105, 'Eve Adams', 18, 'Completed')
('Curry House', 106, 'Frank White', 45.3, 'Pending')
('Pasta Place', 107, 'Grace Green', 22.5, 'Completed')
('Mexicano Grill', 108, 'Harry Black', 35, 'Pending')
('Noodle Nirvana', 109, 'Ivy Lee', 60, 'Completed')
('Steakhouse Supreme', 110, 'Jack King', 28.75, 'Pending')
('Vegan Delights', None, None, None, None)

All restaurants including one with no orders (LEFT JOIN, after adding 'Empty Table Bistro'):
('Pizza Palace', 101, 'Alice Smith', 25.5, 'Completed')
('Pizza Palace', 102, 'Bob Johnson', 30, 'Pending')
('Taco Time', 103, 'Charlie Brown', 15.75, 'Completed')
('Sushi Spot', 104, 'Diana Prince', 50.2, 'Pending')
('Burger Barn', 105, 'Eve Adams', 18, 'Completed')
('Curry House', 106, 'Frank White', 45.3, 'Pending')
('Pasta Place', 107, 'Grace Green', 22.5, 'Completed')
('Mexicano Grill', 108, 'Harry Black', 35, 'Pending')
('Noodle Nirvana', 109, 'Ivy Lee', 60, 'Completed')
('Steakhouse Supreme', 110, 'Jack King', 28.75, 'Pending')
('Vegan Delights', None, None, None, None)
('Empty Table Bistro', None, None, None, None)